Revit 2026 API

# ProgressChangedEventArgs Class

---

The event arguments used by the ProgressChanged event.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitAPIEventArgs Autodesk.Revit.DB.EventsRevitAPISingleEventArgs Autodesk.Revit.DB.EventsProgressChangedEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ProgressChangedEventArgs : RevitAPISingleEventArgs
```
```vb
Public Class ProgressChangedEventArgs
	Inherits RevitAPISingleEventArgs
```
```cpp
public ref class ProgressChangedEventArgs : public RevitAPISingleEventArgs
```
```fsharp
type ProgressChangedEventArgs =
    class
        inherit RevitAPISingleEventArgs
    end
```

The ProgressChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Caption | The text from the progress bar caption that describes the operation in progress |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | LowerRange | Lower part of progress bar range - always zero |
|  | Position | Progress bar position - value is always between zero and upperRange and is incremented by one with each event of stage "PositionChanged" |
|  | Stage | The current stage of the progress bar |
|  | UpperRange | Upper part of progress bar range - will be any non-zero number |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Requests to cancel the progress bar's operation. |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace